Catalogs/ГрафикиПоставкиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГрафикиПоставкиТовара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Расчетчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>График</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньПоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНедель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГрафикиПоставкиТовара/Ext/ManagerModule.bsl
Функция ПолучитьОписаниеДняНедели(мДеньНедели)
	
	Если мДеньНедели = Перечисления.ДниНедели.Понедельник Тогда
		Возврат "ПН";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Вторник Тогда
		Возврат "ВТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Среда Тогда
		Возврат "СР";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Четверг Тогда
		Возврат "ЧТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Пятница Тогда
		Возврат "ПТ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Суббота Тогда
		Возврат "СБ";
	ИначеЕсли мДеньНедели = Перечисления.ДниНедели.Воскресенье Тогда
		Возврат "ВС";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНаименование(График) Экспорт
	
	ТекПредставление = "";
	Для Каждого СтрокаТЧ Из График Цикл
		
		ТекПредставление = ТекПредставление + ?(ЗначениеЗаполнено(ТекПредставление), ", ", "") +
										ПолучитьОписаниеДняНедели(СтрокаТЧ.ДеньЗаказа) + "->" + ПолучитьОписаниеДняНедели(СтрокаТЧ.ДеньПоставки);
		
	КонецЦикла;
	
	Возврат ТекПредставление;
	
КонецФункции
